gm-jiang/controlbox_gen2/ti/tirtos_simplelink_2_11_01_09/products/cc26xxware_2_00_06_14829/driverlib/setup.c
/******************************************************************************
*  Filename:       setup.c
*  Revised:        2015-01-16 10:44:49 +0100 (fr, 16 jan 2015)
*  Revision:       42411
*
*  Description:    Setup file for CC26xx PG2 device family.
*
*  Copyright (c) 2015, Texas Instruments Incorporated
*  All rights reserved.
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions are met:
*
*  1) Redistributions of source code must retain the above copyright notice,
*     this list of conditions and the following disclaimer.
*
*  2) Redistributions in binary form must reproduce the above copyright notice,
*     this list of conditions and the following disclaimer in the documentation
*     and/or other materials provided with the distribution.
*
*  3) Neither the name of the ORGANIZATION nor the names of its contributors may
*     be used to endorse or promote products derived from this software without
*     specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
*  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
*  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
*  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
*  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
*  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
*  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
*  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
*  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
*  POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

// Hardware headers
#include <inc/hw_memmap.h>
#include <inc/hw_types.h>
#include <inc/hw_adi.h>
#include <inc/hw_adi_0_rf.h>
#include <inc/hw_adi_1_synth.h>
#include <inc/hw_adi_2_refsys.h>
#include <inc/hw_adi_3_refsys.h>
#include <inc/hw_adi_4_aux.h>
#include <inc/hw_aon_ioc.h>
#include <inc/hw_aon_sysctl.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aux_wuc.h>
#include <inc/hw_ccfg.h>
#include <inc/hw_chip_def.h>
#include <inc/hw_ddi.h>
#if ( CC_GET_CHIP_OPTION == CC_CHIP_OPTION_OTP )
#else
#include <inc/hw_flash.h>
#endif
#include <inc/hw_fcfg1.h>
#include <inc/hw_ddi_0_osc.h>
#include <inc/hw_prcm.h>
#include <inc/hw_vims.h>
#include <inc/hw_aon_batmon.h>
#include <inc/hw_aon_rtc.h>
// Driverlib headers
#include <driverlib/adi.h>
#include <driverlib/cpu.h>
#include <driverlib/chipinfo.h>
#include <driverlib/ddi.h>
#include <driverlib/prcm.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/aon_batmon.h>

// We need intrinsic functions for IAR (if used in source code)
#ifdef __IAR_SYSTEMS_ICC__
#include <intrinsics.h>
#endif

// Due to a misunderstanding when probing the first wafer this VDDR trim
// was not written to the EFUSE registers (only in the EFUSE shadow in FCFG1)
// The VDDR trim is therefore not done by the boot code and must be done here.
// This code can be removed when chips from the first wafer is no longer supported.
#define INCLUDE_VDDR_TEMPORARILY    1

// Bit defines for CUSTOMER_CFG_O_MODE_CONF:SCLK_LF_OPTION
#define CLK_LF_RCOSC_LF 0xC00000
#define CLK_LF_XOSC_LF  0x800000
#define CLK_LF_XOSC_HF  0x000000

//*****************************************************************************
//
// Function declarations
//
//*****************************************************************************
void   trimDevice( void );
static uint32_t GetTrimForAdcShModeEn( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForAdcShVbufEn( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForAmpcompCtrl( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForAmpcompTh1( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForAmpcompTh2( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForAnabypassValue1( uint32_t ui32Fcfg1Revision, uint32_t ccfg_ModeConfReg );
static uint32_t GetTrimForDblrLoopFilterResetVoltage( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForRadcExtCfg( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForRcOscLfIBiasTrim( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForRcOscLfRtuneCtuneTrim( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForXoscHfCtl( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForXoscHfFastStart( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForXoscHfIbiastherm( uint32_t ui32Fcfg1Revision );
static uint32_t GetTrimForXoscLfRegulatorAndCmirrwrRatio( uint32_t ui32Fcfg1Revision );

#if ( INCLUDE_VDDR_TEMPORARILY )
static int32_t  SignExtendVddrTrimValue( uint32_t ui32VddrTrimVal );
#endif
static void     HapiTrimDeviceColdReset( uint32_t ui32Fcfg1Revision );
static void     HapiTrimDeviceShutDown( uint32_t ui32Fcfg1Revision );
static void     HapiTrimDevicePowerDown( uint32_t ui32Fcfg1Revision );

typedef void (* WorkaroundFunctionPointer_t) (uint32_t, uint32_t, uint32_t);


//*****************************************************************************
//
//! Defined time delay assuming 48 MHz clock and resolution of 3 cycles
//
//*****************************************************************************
#define DELAY_20_USEC           0x140


//*****************************************************************************
//
// Defined CPU delay macro with microseconds as input
// Quick check shows: (Tob be further investigated)
// At 48 MHz RCOSC and VIMS.CONTROL.PREFETCH = 0, there is 5 cycles
// At 48 MHz RCOSC and VIMS.CONTROL.PREFETCH = 1, there is 4 cycles
// At 24 MHz RCOSC and VIMS.CONTROL.PREFETCH = 0, there is 3 cycles
//
//*****************************************************************************
#define CPU_DELAY_MICRO_SECONDS( x ) \
   CPUdelay(((uint32_t)((( x ) * 48.0 ) / 5.0 )) - 1 )

//*****************************************************************************
//
// This array holds the precompiled code. Ref. function WrkAroundTrimDevice()
//
//*****************************************************************************
static const uint8_t g_pui8InstructionCode[] = {0x30, 0xB4, 0x03, 0x23,
                                                0x03, 0x60, 0x03, 0x23,
                                                0x03, 0x62, 0x10, 0xF1,
                                                0x24, 0x03, 0x13, 0xF0,
                                                0x70, 0x43, 0x10, 0xF1,
                                                0x24, 0x04, 0x24, 0x03,
                                                0x24, 0x0B, 0x53, 0xEA,
                                                0x44, 0x13, 0x43, 0xF0,
                                                0x00, 0x73, 0x53, 0xF0,
                                                0x04, 0x03, 0x01, 0x24,
                                                0x1C, 0x60, 0x4A, 0xF6,
                                                0xAA, 0x23, 0x42, 0xF2,
                                                0x64, 0x04, 0x23, 0x50,
                                                0x10, 0xF5, 0x02, 0x53,
                                                0x1B, 0x68, 0x5B, 0x1D,
                                                0x10, 0x2B, 0x04, 0xD3,
                                                0x0F, 0x23, 0x10, 0xF5,
                                                0x02, 0x54, 0x23, 0x60,
                                                0x06, 0xE0, 0x10, 0xF5,
                                                0x02, 0x53, 0x1B, 0x68,
                                                0x5B, 0x1D, 0x10, 0xF5,
                                                0x02, 0x54, 0x23, 0x60,
                                                0x45, 0xF2, 0xAA, 0x53,
                                                0x42, 0xF2, 0x64, 0x04,
                                                0x23, 0x50, 0x0B, 0x68,
                                                0x33, 0xF0, 0x04, 0x03,
                                                0x0B, 0x60, 0xD4, 0x6A,
                                                0x43, 0x69, 0x0B, 0x25,
                                                0x65, 0xF3, 0x04, 0x03,
                                                0x43, 0x61, 0x08, 0x68,
                                                0x50, 0xF0, 0x04, 0x00,
                                                0x08, 0x60, 0xD0, 0x6A,
                                                0x30, 0xBC, 0x70, 0x47
                                               };


//*****************************************************************************
//
//! Perform the necessary trim of the device which is not done in boot code
//!
//! This function should only execute coming from ROM boot. The current
//! implementation does not take soft reset into account. However, it does no
//! damage to execute it again. It only consumes time.
//
//*****************************************************************************
void
trimDevice(void)
{
    uint32_t ui32Fcfg1Revision;
    uint32_t ui32AonSysResetctl;
    uint32_t ui32Cnt;
    uint8_t pInstructions[sizeof(g_pui8InstructionCode)];
    WorkaroundFunctionPointer_t FuncPointer;

    //
    // Get layout revision of the factory configuration area
    // (Handle undefined revision as revision = 0)
    //
    ui32Fcfg1Revision = HWREG(FCFG1_BASE + FCFG1_O_FCFG1_REVISION);
    if ( ui32Fcfg1Revision == 0xFFFFFFFF ) {
        ui32Fcfg1Revision = 0;
    }

#if defined( CHECK_AT_STARTUP_FOR_CORRECT_FAMILY_ONLY )
    //
    // This driverlib version and setup file is for CC26xx PG2.0 and later
    // (Keeping this check at HwRev2.0 independent of "#else" check)
    // Halt if violated
    //
    ThisCodeIsBuiltForCC26xxHwRev20AndLater_HaltIfViolated();
#else

    //
    // This driverlib version and setup file is for CC26xx PG2.0 and later
    // Halt if violated
    //
    ThisCodeIsBuiltForCC26xxHwRev20AndLater_HaltIfViolated();

#endif

