gm-jiang/controlbox_gen2/ti/tirtos_simplelink_2_11_01_09/products/cc26xxware_2_00_06_14829/driverlib/setup.c
    // Set bit DDI_0_OSC_CTL0_XTAL_IS_24M (this is bit 31 in DDI_0_OSC_O_CTL0)
    HWREGB( AUX_DDI0_OSC_BASE + DDI_O_MASK4B + ( DDI_0_OSC_O_CTL0 * 2 ) + 7 ) = 0x88;

    // Setting DDI_0_OSC_CTL1_XOSC_HF_FAST_START according to value found in FCFG1
    ui32Trim = GetTrimForXoscHfFastStart( ui32Fcfg1Revision );
    HWREGB( AUX_DDI0_OSC_BASE + DDI_O_MASK4B + ( 0x00000004 * 2 )) = ( 0x30 | ui32Trim );

    //
    // Update ADI_4_AUX_ADCREF1_VTRIM with value from FCFG1
    //
    HWREGB( AUX_ADI4_BASE + ADI_4_AUX_O_ADCREF1  ) =
      ((( HWREG( FCFG1_BASE + FCFG1_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT ) >>
      FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_S ) <<
      ADI_4_AUX_ADCREF1_VTRIM_S ) &
      ADI_4_AUX_ADCREF1_VTRIM_M );

    //
    // Set ADI_4_AUX:ADC0.SMPL_CYCLE_EXP to it's default minimum value (=3)
    // (Note: Using MASK8B requires that the bits to be modified must be within the same
    //        byte boundary whivh is the case for the ADI_4_AUX_ADC0_SMPL_CYCLE_EXP field)
    //
    HWREGH( AUX_ADI4_BASE + ADI_O_MASK8B + ( ADI_4_AUX_O_ADC0 * 2 )) =
      ( ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_M << 8 ) | ( 3 << ADI_4_AUX_ADC0_SMPL_CYCLE_EXP_S );

    //
    // Sync with AON
    //
    SysCtrlAonSync();

    //
    // Disable clock for OSC_DIG and release power on AUX
    //
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN0) = 0x0;

    //
    // Release "Force AUX on"
    //
    // No need to save the current status of the power/clock registers.
    // At this point both AUX and AON should have been reset to 0x0.
    //
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) = 0;

#if ( CC_GET_CHIP_OPTION != CC_CHIP_OPTION_OTP )
    // Disable EFUSE clock
    HWREGBITW( FLASH_BASE + FLASH_O_CFG, FLASH_CFG_DIS_EFUSECLK_BITN ) = 1;
#endif
}

#if ( INCLUDE_VDDR_TEMPORARILY )
static int32_t
SignExtendVddrTrimValue( uint32_t ui32VddrTrimVal )
{
    //
    // The VDDR trim value is 5 bits representing the range from -10 to +21
    // (where -10=0x16, -1=0x1F, 0=0x00, 1=0x01 and +21=0x15)
    //
    int32_t i32SignedVddrVal = ui32VddrTrimVal;
    if ( i32SignedVddrVal > 0x15 ) {
        i32SignedVddrVal -= 0x20;
    }
    return ( i32SignedVddrVal );
}
#endif

static void
HapiTrimDeviceColdReset(uint32_t ui32Fcfg1Revision)
{
#if ( INCLUDE_VDDR_TEMPORARILY )
    int32_t i32TargetTrim   ; // Target trim sign extended
    int32_t i32CurrentTrim  ; // Current trim sign extended
    int32_t i32DeltaVal     ; // Delta Value for each 1/64 loop

    //
    // Check if trim of Global LDO is required. Only required on PG1 devices
    //
    //
    // PG1 device. Trim the Global LDO in staircase steps to avoid
    // system reset while all the BOD reset sources are disabled
    //
    i32TargetTrim = SignExtendVddrTrimValue((
      HWREG( FCFG1_BASE + FCFG1_O_SHDW_ANA_TRIM ) &
         FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_M ) >>
         FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_S );

    i32CurrentTrim = SignExtendVddrTrimValue((
        HWREGB( ADI3_BASE + ADI_3_REFSYS_O_DCDCCTL0 ) &
        ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M ) >>
        ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_S );

    if ( i32TargetTrim != i32CurrentTrim ) {
        int32_t i32Cnt; // Counter for trim loop
        //
        // Disbale all BOD reset sources
        //
        HWREG( AON_SYSCTL_BASE + AON_SYSCTL_O_RESETCTL ) = 0x00;

        i32DeltaVal = i32TargetTrim - i32CurrentTrim;
        if ( i32DeltaVal > 0 ) {
            i32DeltaVal -= 1;
            i32CurrentTrim  = ( i32CurrentTrim + 1 ) << 6;
        } else { // ( i32DeltaVal < 0 ) (will never become == 0)
            i32DeltaVal += 1;
            i32CurrentTrim  = ( i32CurrentTrim << 6 ) - 1;
        }

        for ( i32Cnt = 0 ; i32Cnt < 64 ; i32Cnt++ ) {
            i32CurrentTrim += i32DeltaVal;

            HWREGB( ADI3_BASE + ADI_O_DIR + ADI_3_REFSYS_O_DCDCCTL0 ) =
                (( i32CurrentTrim >> 6 ) <<
                ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_S ) &
                ADI_3_REFSYS_DCDCCTL0_VDDR_TRIM_M;

            //
            // Delay a total of approx. 300 uS for all 64 rounds in the loop
            //
            CPU_DELAY_MICRO_SECONDS( 300.0 / 64.0 );
        }

        //
        // Delay additionally 700 uS if going more than 1 step down
        // (i32DeltaVal is less than 0 only when going more than one step down)
        //
        if ( i32DeltaVal < 0 ) {
            CPU_DELAY_MICRO_SECONDS( 700.0 );
        }

        //
        // Enable all BOD reset sources
        //
        HWREG( AON_SYSCTL_BASE + AON_SYSCTL_O_RESETCTL ) = (
            AON_SYSCTL_RESETCTL_CLK_LOSS_EN  |
            AON_SYSCTL_RESETCTL_VDD_LOSS_EN  |
            AON_SYSCTL_RESETCTL_VDDR_LOSS_EN |
            AON_SYSCTL_RESETCTL_VDDS_LOSS_EN   );
    }
#endif
}

//*****************************************************************************
//
//! Returns the trim value to be used for the ANABYPASS_VALUE1 register in
//! OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForAnabypassValue1( uint32_t ui32Fcfg1Revision, uint32_t ccfg_ModeConfReg )
{
    uint32_t ui32Fcfg1Value            ;
    uint32_t ui32XoscHfRow             ;
    uint32_t ui32XoscHfCol             ;
    int32_t  i32CustomerDeltaAdjust    ;
    uint32_t ui32TrimValue             ;

    if ( ui32Fcfg1Revision == 0 ) {
        // Set hardcoded trim values for all bit fields in the
        // ANABYPASS_VALUE1 register
        ui32TrimValue = 0x000F0FFF;
    } else {
        // Use device specific trim values located in factory configuration
        // area for the XOSC_HF_COLUMN_Q12 and XOSC_HF_ROW_Q12 bit fields in
        // the ANABYPASS_VALUE1 register. Value for the other bit fields
        // are set to 0.

        ui32Fcfg1Value = HWREG(FCFG1_BASE + FCFG1_O_CONFIG_OSC_TOP);
        ui32XoscHfRow = (( ui32Fcfg1Value &
            FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_M ) >>
            FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_S );
        ui32XoscHfCol = (( ui32Fcfg1Value &
            FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_M ) >>
            FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_S );

        i32CustomerDeltaAdjust = 0;
        if (( ccfg_ModeConfReg & CCFG_MODE_CONF_XOSC_CAP_MOD ) == 0 ) {
            // XOSC_CAP_MOD = 0 means: CAP_ARRAY_DELTA is in use -> Apply compensation
            // XOSC_CAPARRAY_DELTA is located in bit[15:8] of ccfg_ModeConfReg
            // Note: HW_REV_DEPENDENT_IMPLEMENTATION. Field width is not given by
            // a define and sign extention must therefore be hardcoded.
            // ( A small testprogram is created vrifying the code lines below:
            //   Ref.: ..\test\small_standalone_test_programs\CapArrayDeltaAdjust_test.c)
            i32CustomerDeltaAdjust = ((int32_t)ccfg_ModeConfReg << 16 ) >> 24;

