gm-jiang/controlbox_gen2/ti/tirtos_simplelink_2_11_01_09/products/cc26xxware_2_00_06_14829/driverlib/setup.c
   return ( dblrLoopFilterResetVoltageValue );
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as ADC_SH_MODE_EN setting
//
//*****************************************************************************
static uint32_t
GetTrimForAdcShModeEn( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForAdcShModeEnValue = 1; // Recommanded default setting

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      getTrimForAdcShModeEnValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_ADC_SH_MODE_EN_M ) >>
         FCFG1_OSC_CONF_ADC_SH_MODE_EN_S;
   }

   return ( getTrimForAdcShModeEnValue );
}

//*****************************************************************************
//
//! Returns the trim value from FCFG1 to be used as ADC_SH_VBUF_EN setting
//
//*****************************************************************************
static uint32_t
GetTrimForAdcShVbufEn( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForAdcShVbufEnValue = 1; // Recommanded default setting

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      getTrimForAdcShVbufEnValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_ADC_SH_VBUF_EN_M ) >>
         FCFG1_OSC_CONF_ADC_SH_VBUF_EN_S;
   }

   return ( getTrimForAdcShVbufEnValue );
}

//*****************************************************************************
//
//! Returns the trim value to be used for the XOSCHFCTL register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForXoscHfCtl( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForXoschfCtlValue = 0; // Recommanded default setting
   uint32_t fcfg1Data;

   if ( ui32Fcfg1Revision >= 0x00000020 ) {
      fcfg1Data = HWREG( FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1 );
      getTrimForXoschfCtlValue =
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_PEAK_DET_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_PEAK_DET_ITRIM_S);

      getTrimForXoschfCtlValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_HP_BUF_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_HP_BUF_ITRIM_S);

      getTrimForXoschfCtlValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_M ) >>
             FCFG1_MISC_OTP_DATA_1_LP_BUF_ITRIM_S ) <<
           DDI_0_OSC_XOSCHFCTL_LP_BUF_ITRIM_S);
   }

   return ( getTrimForXoschfCtlValue );
}

//*****************************************************************************
//
//! Returns the trim value to be used as OSC_DIG:CTL1.XOSC_HF_FAST_START
//
//*****************************************************************************
static uint32_t
GetTrimForXoscHfFastStart( uint32_t ui32Fcfg1Revision )
{
   uint32_t ui32XoscHfFastStartValue   ;

   if ( ui32Fcfg1Revision == 0 ) {
      // Use reset value
      ui32XoscHfFastStartValue = 0;
   } else {
      // Get value from FCFG1
      ui32XoscHfFastStartValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_XOSC_HF_FAST_START_M ) >>
         FCFG1_OSC_CONF_XOSC_HF_FAST_START_S;
   }

   return ( ui32XoscHfFastStartValue );
}

//*****************************************************************************
//
//! Returns the trim value to be used for the RADCEXTCFG register in OSC_DIG
//
//*****************************************************************************
static uint32_t
GetTrimForRadcExtCfg( uint32_t ui32Fcfg1Revision )
{
   uint32_t getTrimForRadcExtCfgValue = 0x403F8000; // Recommanded default setting
   uint32_t fcfg1Data;

   if ( ui32Fcfg1Revision >= 0x00000020 ) {
      fcfg1Data = HWREG( FCFG1_BASE + FCFG1_O_MISC_OTP_DATA_1 );
      getTrimForRadcExtCfgValue =
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_M ) >>
             FCFG1_MISC_OTP_DATA_1_HPM_IBIAS_WAIT_CNT_S ) <<
           DDI_0_OSC_RADCEXTCFG_HPM_IBIAS_WAIT_CNT_S);

      getTrimForRadcExtCfgValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_M ) >>
             FCFG1_MISC_OTP_DATA_1_LPM_IBIAS_WAIT_CNT_S ) <<
           DDI_0_OSC_RADCEXTCFG_LPM_IBIAS_WAIT_CNT_S);

      getTrimForRadcExtCfgValue |=
         ( ( ( fcfg1Data & FCFG1_MISC_OTP_DATA_1_IDAC_STEP_M ) >>
             FCFG1_MISC_OTP_DATA_1_IDAC_STEP_S ) <<
           DDI_0_OSC_RADCEXTCFG_IDAC_STEP_S);
   }

   return ( getTrimForRadcExtCfgValue );
}

//*****************************************************************************
//
// Returns the FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM
//
//*****************************************************************************
static uint32_t
GetTrimForRcOscLfIBiasTrim( uint32_t ui32Fcfg1Revision )
{
   uint32_t trimForRcOscLfIBiasTrimValue = 0; // Default value

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      trimForRcOscLfIBiasTrimValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_M ) >>
         FCFG1_OSC_CONF_ATESTLF_RCOSCLF_IBIAS_TRIM_S ;
   }

   return ( trimForRcOscLfIBiasTrimValue );
}

//*****************************************************************************
//
// Returns XOSCLF_REGULATOR_TRIM and XOSCLF_CMIRRWR_RATIO as one packet
// spanning bits [5:0] in the returned value.
//
//*****************************************************************************
static uint32_t
GetTrimForXoscLfRegulatorAndCmirrwrRatio( uint32_t ui32Fcfg1Revision )
{
   uint32_t trimForXoscLfRegulatorAndCmirrwrRatioValue = 0; // Default value for both fields

   if ( ui32Fcfg1Revision >= 0x00000022 ) {
      trimForXoscLfRegulatorAndCmirrwrRatioValue = ( HWREG( FCFG1_BASE + FCFG1_O_OSC_CONF ) &
         ( FCFG1_OSC_CONF_XOSCLF_REGULATOR_TRIM_M |
           FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_M  )) >>
           FCFG1_OSC_CONF_XOSCLF_CMIRRWR_RATIO_S  ;
   }

   return ( trimForXoscLfRegulatorAndCmirrwrRatioValue );
}

////*****************************************************************************
////
//// The binary code of this function has been copied to the const array
//// called g_pui8ProgramFlashCodeInstructions[] in rom.h. This binary code is
//// used both by the HapiProgramFlash function and the FlashProgram function
//// in driverlib.
////
////*****************************************************************************
//uint32_t
//WrkAroundFlashPrg(uint8_t *pui8DataBuffer, uint32_t ui32Address, uint32_t ui32Count,
//                  uint32_t ui32BaseAddr, uint32_t ui32TrimVal, uint32_t ui32RomAddr)
//{
//    uint32_t ui32Status;
//    uint32_t (*FuncPointer)( uint8_t *pui8DataBuffer, uint32_t, uint32_t);
//    uint32_t ui32RegVal;
//
//    //
//    // Save current value of the VREADCT register which is the workaround value
//    // that shall only be used in read mode
//    //
//    ui32RegVal = HWREG(ui32BaseAddr + FLASH_O_FVREADCT);
//
//    //
//    // Set trimmed value for VREADCT which is only valid for write mode.
//    // The unusal addressing of FCFG1 is done in order to avoid that the
//    // compiler makes use of literals
//    //
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0xAAAA;
//    HWREG(ui32BaseAddr + FLASH_O_FVREADCT) = ui32TrimVal;
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0x55AA;
//
//    //
//    // Call the flash programming function in ROM pointed to by ui32RomAddr
//    //
//    FuncPointer = (uint32_t (*)(uint8_t *, uint32_t, uint32_t)) (ui32RomAddr);
//    ui32Status = FuncPointer( pui8DataBuffer, ui32Address, ui32Count);
//
//    //
//    // Restore workaround value for VREADCT which is only valid for read mode.
//    //
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0xAAAA;
//    HWREG(ui32BaseAddr + FLASH_O_FVREADCT) = ui32RegVal;
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0x55AA;
//
//    //
//    // Disable standby in flash bank since ROM function may have enabled it
//    //
//    HWREGBITW(ui32BaseAddr + FLASH_O_CFG, FLASH_CFG_DIS_STANDBY_BITN ) = 1;
//
//    return(ui32Status);
//}
//
////*****************************************************************************
////
//// The binary code of this function has been copied to the const array
//// called g_pui8SectorEraseFlashCodeInstructions[] in rom.h. This binary
//// code is used by both the HapiSectorErase function and the FlashSectorErase
//// function in driverlib.
////
////*****************************************************************************
//uint32_t
//WrkAroundHapiSectorErase(uint32_t ui32Address,
//          uint32_t ui32BaseAddr, uint32_t ui32TrimVal, uint32_t ui32RomAddr)
//{
//    uint32_t ui32Status;
//    uint32_t (*FuncPointer)(uint32_t);
//    uint32_t ui32RegVal;
//
//    //
//    // Save current value of the VREADCT register which is the workaround value
//    // that shall only be used in read mode
//    //
//    ui32RegVal = HWREG(ui32BaseAddr + FLASH_O_FVREADCT);
//
//    //
//    // Set trimmed value for VREADCT which is only valid for write mode.
//    // The unusal addressing of FCFG1 is done in order to avoid that the
//    // compiler makes use of literals
//    //
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0xAAAA;
//    HWREG(ui32BaseAddr + FLASH_O_FVREADCT) = ui32TrimVal;
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0x55AA;
//
//    //
//    // Call the flash programming function in ROM pointed to by ui32RomAddr
//    //
//    FuncPointer = (uint32_t (*)(uint32_t)) (ui32RomAddr);
//    ui32Status = FuncPointer(ui32Address);
//
//    //
//    // Restore workaround value for VREADCT which is only valid for read mode.
//    //
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0xAAAA;
//    HWREG(ui32BaseAddr + FLASH_O_FVREADCT) = ui32RegVal;
//    HWREG(ui32BaseAddr + FLASH_O_FLOCK)    = 0x55AA;
//
//    //
//    // Disable standby in flash bank since ROM function may have enabled it
//    //
//    HWREGBITW(ui32BaseAddr + FLASH_O_CFG, FLASH_CFG_DIS_STANDBY_BITN ) = 1;
//
//    return(ui32Status);
//}
//
////*****************************************************************************
////
//// The binary code of this function has been copied to the const array
//// called g_pui8InstructionCode[] in setup.c (this file)
////
////*****************************************************************************
//void
//WrkAroundTrimDevice(uint32_t ui32RegBase1, uint32_t ui32RegBase2,
//                    uint32_t ui32RegBase3)
//{
//    uint32_t ui32RegVal;
//
//    //
//    // Set waitstates to 3 in FLASH_O_WAITSTATES and FLASH_O_WAIT_SYSCODE
//    //
//    HWREG(ui32RegBase1)        = 0x3;
//    HWREG(ui32RegBase1 + 0x20) = 0x3;
//
//    //
//    // Disable standby in flash bank
//    //
//    HWREGBITW(ui32RegBase1 + FLASH_O_CFG, FLASH_CFG_DIS_STANDBY_BITN ) = 1;
//
//    //
//    // Increment VREADCT with 0x5. Max value is 0xF
//    //
//    HWREG(ui32RegBase1 + FLASH_O_FLOCK) = 0xAAAA;
//    if((HWREG(ui32RegBase1 + FLASH_O_FVREADCT) + 0x5) > 0xF)
//    {
//        HWREG(ui32RegBase1 + FLASH_O_FVREADCT) = 0xF;
//    }
//    else
//    {
//        HWREG(ui32RegBase1 + FLASH_O_FVREADCT) += 0x5;
//    }
//    HWREG(ui32RegBase1 + FLASH_O_FLOCK) = 0x55AA;
//
//    // Power down flash pump and bank
//    HWREG(ui32RegBase2 + AON_WUC_O_MCUCLK) &= ~AON_WUC_MCUCLK_RCOSC_HF_CAL_DONE;
//    HWREG(ui32RegBase3 + AON_RTC_O_SYNC);
//
//    // Set the 5 LSBs of FLASH_O_BANK_0_EFUSE to 0xB
//    ui32RegVal = HWREG(ui32RegBase1 + 0x14);
//    ui32RegVal = (ui32RegVal & 0xFFFFFFE0) | 0xB;
//    HWREG(ui32RegBase1 + 0x14) = ui32RegVal;
//
//    // Reenable powerup flash pump and bank
//    HWREG(ui32RegBase2 + AON_WUC_O_MCUCLK) |= AON_WUC_MCUCLK_RCOSC_HF_CAL_DONE;
//    HWREG(ui32RegBase3 + AON_RTC_O_SYNC);
//}
